START_TEXT = '''
Привет! Добро пожаловать в модельное агентство "Strawberry Glam Models" 🍓. Мы рады видеть здесь талантливых и амбициозных людей, стремящихся к новым вершинам в мире моды и красоты.

В нашем агентстве есть место как для опытных профессионалов, так и для начинающих моделей, готовых обучаться и расти вместе с нами.

Выберите интересующую вас опцию в меню ниже. Мы с нетерпением ждём начала нашего сотрудничества!
'''

CONFIDENTIALITY_POLICY = '''
Мы придаем огромное значение конфиденциальности и защите личных данных наших клиентов и моделей.

Все предоставленные вами данные и материалы используются исключительно для оценки вашей кандидатуры и не передаются третьим лицам.

Мы применяем современные методы шифрования и безопасного хранения данных для обеспечения вашей безопасности.
'''