MODEL_TEXT = '''
В мире вебкам-моделинга опыт играет важную роль, но мы также ценим и новые таланты, стремящиеся развиваться и расти.

Поделитесь, пожалуйста, имеете ли вы опыт работы в вебкам-индустрии? Это поможет нам лучше понять, как мы можем поддержать вашу карьеру в нашем агентстве.
'''

MODEL_ORDER_WEBCAM = '''
В связи с особенностью нашего сообщества, которое характеризуется высокой степенью конфиденциальности и предоставляет уникальные возможности для получения значительных доходов, мы придаем особое значение процессу отбора моделей. 

Если вы заинтересованы в возможности стать частью нашего эксклюзивного проекта, пожалуйста, пройдите наш опрос и отправьте своё портфолио.

Гарантируется, что все предоставленные вами медиаматериалы и портфолио будут использованы исключительно в целях ознакомления нашим HR-специалистом. 

Благодарим за интерес к нашему сообществу. Мы с нетерпением ждем возможности ознакомиться с вашими работами и обсудить перспективы сотрудничества.
'''

MODEL_EQUIPMENT = '''
Если после ознакомления с вашим портфолио мы примем решение предложить вам оффер, хотели бы подчеркнуть, что наше агентство предоставляет не только конкурентоспособные условия сотрудничества, но и всю необходимую техническую поддержку для эффективной работы.

В частности, каждой модели, присоединяющейся к нашему проекту, мы предлагаем:

1) Персональный ноутбук высокой производительности, который позволит вам работать без технических ограничений;

2) Профессиональную веб-камеру и высококачественный микрофон, обеспечивающие идеальное изображение и звук для ваших трансляций;

3) Декорации, которые помогут создать уникальное и привлекательное визуальное оформление вашего рабочего пространства;

В случае необходимости, предоставляем доступ к офису для работы, который уже оборудован всем необходимым для комфортной и продуктивной деятельности.

Мы убеждены, что предоставление высококачественного оборудования и условий работы является ключевым фактором успеха в сфере онлайн-моделинга. Это не только позволяет добиваться высоких профессиональных результатов, но и значительно улучшает общее впечатление зрителей от ваших трансляций.

Наша цель — создать для вас максимально комфортные условия, чтобы вы могли полностью сосредоточиться на своем творчестве и профессиональном росте. Мы заботимся о каждом аспекте вашей работы и стремимся обеспечить вам все необходимое для достижения наилучших результатов.

'''

ABOUT_PLATFORM = '''
Мы предлагаем работу на специализированной онлайн-платформе, которая ориентирована на англоязычную аудиторию и доступна исключительно по подписке. Стоимость подписки для пользователей составляет $170, что напрямую связано с обеспечением конфиденциальности и созданием закрытого сообщества.

**Анонимность и Безопасность**

Одной из наших ключевых задач является обеспечение анонимности и безопасности для всех участников процесса. Платформа обладает строгими мерами контроля доступа и защиты данных, что позволяет нам гарантировать сохранение конфиденциальности информации о моделях. Мы придаем большое значение защите личной информации и предоставляем инструменты для контроля взаимодействия с аудиторией.

**Зарубежная Аудитория**

Работая через нашу платформу, вы получаете возможность взаимодействовать с международной англоязычной аудиторией. Это предоставляет шанс не только расширить географию профессионального взаимодействия, но и познакомиться с различными культурами, а также увеличить потенциальный доход благодаря доступу к зарубежным клиентам.

**Условия Работы**

Наша платформа предлагает гибкий график работы и возможность выбора формата взаимодействия с аудиторией, что делает её подходящей для разнообразных предпочтений и стилей жизни. Работа с нами может быть хорошим вариантом для тех, кто ищет дополнительный или основной источник дохода с возможностью работать из дома.
'''

# Обновленный список вопросов для опроса
survey_questions = [
    "Вы старше 18 лет?",
    "Слышали ли вы о вебкам-индустрии?",
    "Имеете ли вы опыт работы в вебкам-индустрии?",
    "Можете ли вы работать полный рабочий день (8 часов)?",
    "Есть ли у вас опыт работы с иностранными клиентами?",
    "Хотите ли вы работать на нашей платформе?",
    "Владеете ли вы английским языком на разговорном уровне?",
    "Готовы ли вы к обучению и постоянному совершенствованию своих навыков?",
    "Есть ли у вас свое оборудование для работы (компьютер, камера, микрофон)?",
    "Готовы ли вы к гибкому графику работы, включая ночные смены?",
    "Знакомы ли вы с основами макияжа и стилизации для камеры?",
    "Готовы ли вы к долгосрочному сотрудничеству (минимум 6 месяцев)?",
    "Есть ли у вас тихое место для работы без посторонних шумов?"
]

# Варианты ответов для вопросов о росте, весе и возрасте
age_options = ["18-21", "22-26", "27-30", "31 и старше"]
height_options = ["Менее 150 см", "150-160 см", "161-170 см", "171-180 см", "Более 180 см"]
weight_options = ["Менее 50 кг", "50-60 кг", "61-70 кг", "71-80 кг", "Более 80 кг"]